spec/cassettes/subscriptions/POST_to_/subscriptions/creates_a_subscription.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: email=walter%40lebowski.me&source=tok_1CwL4DFuGCUWqFqFtVBg8u1P
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.17.0
      Authorization:
      - Bearer REDACTED
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.17.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 15.6.0 Darwin Kernel Version 15.6.0: Tue Jan 30
        11:45:51 PST 2018; root:xnu-3248.73.8~1/RELEASE_X86_64 x86_64","hostname":"Daniels-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 07 Aug 2018 02:38:01 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1449'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_hc8Jo3XjBne470
      Stripe-Version:
      - '2018-05-21'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_DN5FMsgPFiSFKU",
          "object": "customer",
          "account_balance": 0,
          "created": 1533609481,
          "currency": null,
          "default_source": "card_1CwL4DFuGCUWqFqFUJzvjGvD",
          "delinquent": false,
          "description": null,
          "discount": null,
          "email": "walter@lebowski.me",
          "invoice_prefix": "16DDF7D",
          "livemode": false,
          "metadata": {
          },
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_1CwL4DFuGCUWqFqFUJzvjGvD",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": "55444",
                "address_zip_check": "pass",
                "brand": "Visa",
                "country": "US",
                "customer": "cus_DN5FMsgPFiSFKU",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 3,
                "exp_year": 2020,
                "fingerprint": "eyOJiDPWcsMpo0dd",
                "funding": "credit",
                "last4": "4242",
                "metadata": {
                },
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_DN5FMsgPFiSFKU/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [

            ],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_DN5FMsgPFiSFKU/subscriptions"
          }
        }
    http_version:
  recorded_at: Tue, 07 Aug 2018 02:38:02 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions
    body:
      encoding: UTF-8
      string: customer=cus_DN5FMsgPFiSFKU&items[0][plan]=t2-development&items[0][quantity]=2&trial_end=1535423882
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.17.0
      Authorization:
      - Bearer REDACTED
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.17.0","lang":"ruby","lang_version":"2.3.0 p0 (2015-12-25)","platform":"x86_64-darwin15","engine":"ruby","publisher":"stripe","uname":"Darwin
        Daniels-MacBook-Air.local 15.6.0 Darwin Kernel Version 15.6.0: Tue Jan 30
        11:45:51 PST 2018; root:xnu-3248.73.8~1/RELEASE_X86_64 x86_64","hostname":"Daniels-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 07 Aug 2018 02:38:02 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2185'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - Request-Id, Stripe-Manage-Version, X-Stripe-External-Auth-Required, X-Stripe-Privileged-Session-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_wiYmmJEc7p16uv
      Stripe-Version:
      - '2018-05-21'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains; preload
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_DN5FUIJwpr7Nbj",
          "object": "subscription",
          "application_fee_percent": null,
          "billing": "charge_automatically",
          "billing_cycle_anchor": 1535423882,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1533609482,
          "current_period_end": 1535423882,
          "current_period_start": 1533609482,
          "customer": "cus_DN5FMsgPFiSFKU",
          "days_until_due": null,
          "discount": null,
          "ended_at": null,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_DN5FkHCqasAU6a",
                "object": "subscription_item",
                "created": 1533609482,
                "metadata": {
                },
                "plan": {
                  "id": "t2-development",
                  "object": "plan",
                  "active": true,
                  "aggregate_usage": null,
                  "amount": 5000,
                  "billing_scheme": "per_unit",
                  "created": 1533606354,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {
                  },
                  "nickname": "Specialty",
                  "product": "prod_DFE5sMkOQFQngD",
                  "tiers": null,
                  "tiers_mode": null,
                  "transform_usage": null,
                  "trial_period_days": 21,
                  "usage_type": "licensed"
                },
                "quantity": 2,
                "subscription": "sub_DN5FUIJwpr7Nbj"
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_DN5FUIJwpr7Nbj"
          },
          "livemode": false,
          "metadata": {
          },
          "plan": {
            "id": "t2-development",
            "object": "plan",
            "active": true,
            "aggregate_usage": null,
            "amount": 5000,
            "billing_scheme": "per_unit",
            "created": 1533606354,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {
            },
            "nickname": "Specialty",
            "product": "prod_DFE5sMkOQFQngD",
            "tiers": null,
            "tiers_mode": null,
            "transform_usage": null,
            "trial_period_days": 21,
            "usage_type": "licensed"
          },
          "quantity": 2,
          "start": 1533609482,
          "status": "trialing",
          "tax_percent": null,
          "trial_end": 1535423882,
          "trial_start": 1533609482
        }
    http_version:
  recorded_at: Tue, 07 Aug 2018 02:38:02 GMT
recorded_with: VCR 3.0.3
